Console.Clear();
Console.WriteLine("Задача 10");
Console.WriteLine("Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.");
Console.WriteLine("456 - > 5");
Console.WriteLine("782 - > 8");
Console.WriteLine("918 - > 1");
Console.WriteLine(" ");
Console.Write("Введи трёхзначное число: ");
int threeDigitNumber = Convert.ToInt32(Console.ReadLine());
string stringNumber = Convert.ToString(threeDigitNumber);
Console.WriteLine("вторая цифра этого числа -> "+stringNumber[1]);